Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: :cpp:expr:`lv_calendar_add_header_arrow(calendar)` creates a header that contains a left and right arrow on the sides and text between the arrows showing the current year and month.
it_it: :cpp:expr:`lv_calendar_add_header_arrow(calendar)` crea un'intestazione che contiene una freccia sinistra e una freccia destra ai lati e un testo tra le frecce che mostra l'anno e il mese correnti.

source: :cpp:expr:`lv_calendar_add_header_dropdown(calendar)` creates a header that contains 2 Drop-Drown List Widgets for the year and month.
it_it: :cpp:expr:`lv_calendar_add_header_dropdown(calendar)` crea un'intestazione che contiene 2 "Drop-Down List" per l'anno e il mese.

source: :cpp:expr:`lv_calendar_get_pressed_date(calendar, &date)` to set ``date`` to the date currently being pressed.
it_it: :cpp:expr:`lv_calendar_get_pressed_date(calendar, &date)` per impostare ``date`` sulla data attualmente premuta.

source: :cpp:expr:`lv_canvas_fill_bg(canvas, lv_color_hex(0x00ff00), LV_OPA_50)` fills the whole Canvas to blue with 50% opacity.
it_it: :cpp:expr:`lv_canvas_fill_bg(canvas, lv_color_hex(0x00ff00), LV_OPA_50)` riempie l'intero Canvas di blu con un'opacità del 50%.

source: :cpp:expr:`lv_chart_get_point_pos_by_id(chart, series, id, &point_out)` gets the coordinate of a given point on the chart.
it_it: :cpp:expr:`lv_chart_get_point_pos_by_id(chart, series, id, &point_out)` ottiene le coordinate di un dato punto del grafico.

source: :cpp:expr:`lv_chart_get_pressed_point(chart)` returns the zero-based index of the pressed point.
it_it: :cpp:expr:`lv_chart_get_pressed_point(chart)` restituisce l'indice a partire da zero del punto premuto.

source: :cpp:expr:`lv_chart_set_cursor_point(chart, cursor, series, point_id)` places the cursor on the specified data point on the chart.
it_it: :cpp:expr:`lv_chart_set_cursor_point(chart, cursor, series, point_id)` posiziona il cursore sul punto dati specificato sul grafico.

source: :cpp:expr:`lv_chart_set_cursor_pos(chart, cursor, &point)` sets the position of the cursor to an arbitrary point on the chart.
it_it: :cpp:expr:`lv_chart_set_cursor_pos(chart, cursor, &point)` imposta la posizione del cursore su un punto arbitrario del grafico.

source: :cpp:expr:`lv_chart_set_series_ext_x_array(chart, series, value_array)` and
it_it: Anche :cpp:expr:`lv_chart_set_series_ext_x_array(chart, series, value_array)` e

source: :cpp:expr:`lv_chart_set_series_value_by_id2(chart, series, id, x_value, y_value)` and
it_it: :cpp:expr:`lv_chart_set_series_value_by_id2(chart, series, id, x_value, y_value)` e

source: :cpp:expr:`lv_display_add_event_cb(disp, event_cb, LV_EVENT_..., user_data)` adds an event handler to a display.
it_it: :cpp:expr:`lv_display_add_event_cb(disp, event_cb, LV_EVENT_..., user_data)` aggiunge un gestore eventi a un display.

source: :cpp:expr:`lv_display_flush_ready(display1)` needs to be called when flushing is complete to inform LVGL that the buffer is available again to render new content into it.
it_it: :cpp:expr:`lv_display_flush_ready(display1)` deve essere chiamata al termine del flushing per informare LVGL che il buffer è nuovamente disponibile per il rendering di nuovo contenuto.

source: :cpp:expr:`lv_display_get_layer_sys(disp)`, and
it_it: :cpp:expr:`lv_display_get_layer_sys(disp)` e

source: :cpp:expr:`lv_display_rotate_area(display, &area)` rotates the rendered area according to the current rotation settings of the display.
it_it: :cpp:expr:`lv_display_rotate_area(display, &area)` ruota l'area renderizzata in base alle impostazioni di rotazione correnti del display.

source: :cpp:expr:`lv_draw_arc(layer, &dsc)` creates a task to render an arc.
it_it: :cpp:expr:`lv_draw_arc(layer, &dsc)` crea un task per il rendering di un arco.

source: :cpp:expr:`lv_draw_arc_dsc_init(&dsc)` initializes an arc descriptor.
it_it: :cpp:expr:`lv_draw_arc_dsc_init(&dsc)` inizializza un descrittore di arco.

source: :cpp:expr:`lv_draw_blur(layer, &dsc, area)` creates a task to blur an area.
it_it: :cpp:expr:`lv_draw_blur(layer, &dsc, area)` crea un task per sfocare un'area.

source: :cpp:expr:`lv_draw_blur_dsc_init(&dsc)` initializes a blur descriptor.
it_it: :cpp:expr:`lv_draw_blur_dsc_init(&dsc)` inizializza un descrittore di blur.

source: :cpp:expr:`lv_draw_border_dsc_init(&dsc)` initializes a border Draw Task.
it_it: :cpp:expr:`lv_draw_border_dsc_init(&dsc)` inizializza un Task di Disegno dei bordi.

source: :cpp:expr:`lv_draw_box_shadow_dsc_init(&dsc)` initializes a box shadow Draw Task.
it_it: :cpp:expr:`lv_draw_box_shadow_dsc_init(&dsc)` Inizializza un Task di Disegno dell'ombra rettangolare.

source: :cpp:expr:`lv_draw_character(layer, &dsc, point, unicode_letter)` creates a task to draw a character at a specific point.
it_it: :cpp:expr:`lv_draw_character(layer, &dsc, point, unicode_letter)` crea un task per disegnare un carattere in un punto specifico.

source: :cpp:expr:`lv_draw_eve_touch_create(disp)` creates a touch :ref:`indev` for the display.
it_it: :cpp:expr:`lv_draw_eve_touch_create(disp)` crea un touch :ref:`indev` per il display.

source: :cpp:expr:`lv_draw_fill_dsc_init(&dsc)` initializes a fill Draw Task.
it_it: :cpp:expr:`lv_draw_fill_dsc_init(&dsc)` inizializza un Task di Disegno di riempimento.

source: :cpp:expr:`lv_draw_get_next_available_task(layer, previous_task, draw_unit_id)` is a useful helper function which is used by the ``dispatch_cb`` to get the next Draw Task it should act on.
it_it: :cpp:expr:`lv_draw_get_next_available_task(layer, previous_task, draw_unit_id)` è un'utile funzione di supporto utilizzata da ``dispatch_cb`` per ottenere la successiva Draw Task su cui deve agire.

source: :cpp:expr:`lv_draw_image(layer, &dsc, area)` creates a task to draw an image in a given area.
it_it: :cpp:expr:`lv_draw_image(layer, &dsc, area)` crea un task per disegnare un'immagine in un'area specifica.

source: :cpp:expr:`lv_draw_image_dsc_init(&dsc)` initializes an image draw descriptor.
it_it: :cpp:expr:`lv_draw_image_dsc_init(&dsc)` inizializza un descrittore di disegno di immagini.

source: :cpp:expr:`lv_draw_label(layer, &dsc, area)` creates a task to render text in an area.
it_it: :cpp:expr:`lv_draw_label(layer, &dsc, area)` crea un task per il rendering del testo in un'area.

source: :cpp:expr:`lv_draw_label_dsc_init(&dsc)` initializes a label draw descriptor.
it_it: :cpp:expr:`lv_draw_label_dsc_init(&dsc)` inizializza un descrittore di disegno dell'etichetta.

source: :cpp:expr:`lv_draw_line(layer, &dsc)` creates a task to draw a line.
it_it: :cpp:expr:`lv_draw_line(layer, &dsc)` crea un task per disegnare una linea.

source: :cpp:expr:`lv_draw_line_dsc_init(&dsc)` initializes a line descriptor.
it_it: :cpp:expr:`lv_draw_line_dsc_init(&dsc)` inizializza un descrittore di linea.

source: :cpp:expr:`lv_draw_sw_border(layer, &dsc, area)` creates a Draw Task to draw a border inward from its area.
it_it: :cpp:expr:`lv_draw_sw_border(layer, &dsc, area)` crea un Task per il Disegno di un bordo verso l'interno rispetto alla sua area.

source: :cpp:expr:`lv_draw_sw_box_shadow(layer, &dsc, area)` creates a Draw Task for a rectangle's shadow.
it_it: :cpp:expr:`lv_draw_sw_box_shadow(layer, &dsc, area)` crea un Task di Disegno per l'ombra rettangolare.

source: :cpp:expr:`lv_draw_sw_fill(layer, &dsc, area)` creates a Draw Task to fill an area.
it_it: :cpp:expr:`lv_draw_sw_fill(layer, &dsc, area)` crea un Task di Disegno per riempire un'area.

source: :cpp:expr:`lv_draw_task_get_arc_dsc(draw_task)` retrieves arc descriptor from task.
it_it: :cpp:expr:`lv_draw_task_get_arc_dsc(draw_task)` recupera il descrittore dell'arco dal task.

source: :cpp:expr:`lv_draw_task_get_blur_dsc(draw_task)` retrieves blur descriptor.
it_it: :cpp:expr:`lv_draw_task_get_blur_dsc(draw_task)` recupera il descrittore di "blur".

source: :cpp:expr:`lv_draw_task_get_border_dsc(draw_task)` retrieves the border descriptor from a Draw Task.
it_it: :cpp:expr:`lv_draw_task_get_border_dsc(draw_task)` recupera il descrittore del bordo da un Task di Disegno.

source: :cpp:expr:`lv_draw_task_get_box_shadow_dsc(draw_task)` retrieves the box shadow descriptor from a Draw Task.
it_it: :cpp:expr:`lv_draw_task_get_box_shadow_dsc(draw_task)` recupera il descrittore dell'ombra rettangolare da un Task di Disegno.

source: :cpp:expr:`lv_draw_task_get_fill_dsc(draw_task)` retrieves the fill descriptor from a Draw Task.
it_it: :cpp:expr:`lv_draw_task_get_fill_dsc(draw_task)` recupera il descrittore di riempimento da un Task di Disegno.

source: :cpp:expr:`lv_draw_task_get_image_dsc(draw_task)` retrieves the image descriptor from a task.
it_it: :cpp:expr:`lv_draw_task_get_image_dsc(draw_task)` recupera il descrittore di immagine da un task.

source: :cpp:expr:`lv_draw_task_get_label_dsc(draw_task)` retrieves the label descriptor from a task.
it_it: :cpp:expr:`lv_draw_task_get_label_dsc(draw_task)` recupera il descrittore di etichetta da un task.

source: :cpp:expr:`lv_draw_task_get_line_dsc(draw_task)` retrieves line descriptor.
it_it: :cpp:expr:`lv_draw_task_get_line_dsc(draw_task)` recupera il descrittore di linea.

source: :cpp:expr:`lv_draw_task_get_triangle_dsc(draw_task)` retrieves triangle descriptor.
it_it: :cpp:expr:`lv_draw_task_get_triangle_dsc(draw_task)` recupera il descrittore del triangolo.

source: :cpp:expr:`lv_draw_triangle(layer, &dsc)` creates a task to draw a triangle.
it_it: :cpp:expr:`lv_draw_triangle(layer, &dsc)` crea un task per disegnare un triangolo.

source: :cpp:expr:`lv_draw_triangle_dsc_init(&dsc)` initializes a triangle descriptor.
it_it: :cpp:expr:`lv_draw_triangle_dsc_init(&dsc)` inizializza un descrittore di triangolo.

source: :cpp:expr:`lv_dropdown_get_selected_str(dropdown, buf, buf_size)` copies the *name* of the selected option to ``buf``.
it_it: :cpp:expr:`lv_dropdown_get_selected_str(dropdown, buf, buf_size)` copia il *nome* dell'opzione selezionata in ``buf``.

source: :cpp:expr:`lv_event_get_code(e)`: get the event code
it_it: :cpp:expr:`lv_event_get_code(e)`: ottiene il codice dell'evento

source: :cpp:expr:`lv_event_get_current_target(e)`: get Widget to which an event was sent.
it_it: :cpp:expr:`lv_event_get_current_target(e)`: ottiene il Widget a cui è stato inviato un evento.

source: :cpp:expr:`lv_event_get_gesture_state(lv_event_t * e, lv_indev_gesture_type_t type)`: Get the state of the gesture as :cpp:type:`lv_indev_gesture_state_t`.
it_it: :cpp:expr:`lv_event_get_gesture_state(lv_event_t * e, lv_indev_gesture_type_t type)`: Ottiene lo stato del gesto come :cpp:type:`lv_indev_gesture_state_t`.

source: :cpp:expr:`lv_event_get_gesture_type(lv_event_t * e)`: Get the type of the gesture.
it_it: :cpp:expr:`lv_event_get_gesture_type(lv_event_t * e)`: Ottiene il tipo di gesto.

source: :cpp:expr:`lv_event_get_param(e)` returns a pointer to an :cpp:struct:`lv_area_t` object with the coordinates of the area to be invalidated.
it_it: :cpp:expr:`lv_event_get_param(e)` restituisce un puntatore a un oggetto :cpp:struct:`lv_area_t` con le coordinate dell'area da invalidare.

source: :cpp:expr:`lv_event_get_param(e)`: get the parameter passed as the last parameter of :cpp:func:`lv_obj_send_event_cb`
it_it: :cpp:expr:`lv_event_get_param(e)`: ottiene il parametro passato come ultimo parametro di :cpp:func:`lv_obj_send_event_cb`

source: :cpp:expr:`lv_event_get_pinch_scale(lv_event_t * e)`: Get the pinch scale.
it_it: :cpp:expr:`lv_event_get_pinch_scale(lv_event_t * e)`: Ottiene la scala del "pinch".

source: :cpp:expr:`lv_event_get_rotation(lv_event_t * e)`: Get the rotation in radians.
it_it: :cpp:expr:`lv_event_get_rotation(lv_event_t * e)`: Ottiene la rotazione in radianti.

source: :cpp:expr:`lv_event_get_target(e)`: get the Widget, Display or Indev that originally triggered the event (different from :cpp:func:`lv_event_get_current_target` if :ref:`event bubbling <event_bubbling>` is enabled).
it_it: :cpp:expr:`lv_event_get_target(e)`: ottiene il Widget, Display o Indev che ha originariamente attivato l'evento (diverso da :cpp:func:`lv_event_get_current_target` se :ref:`event bubbling <event_bubbling>` è abilitato).

source: :cpp:expr:`lv_event_get_target_obj(e)`: get the Widget that originally triggered the event.
it_it: :cpp:expr:`lv_event_get_target_obj(e)`: ottiene il Widget che ha originariamente attivato l'evento.

source: :cpp:expr:`lv_event_get_two_fingers_swipe_dir(lv_event_t * e)`: Get the direction from the starting center.
it_it: :cpp:expr:`lv_event_get_two_fingers_swipe_dir(lv_event_t * e)`: Ottiene la direzione dal centro di partenza.

source: :cpp:expr:`lv_event_get_two_fingers_swipe_distance(lv_event_t * e)`: Get the distance in pixels from the gesture starting center.
it_it: :cpp:expr:`lv_event_get_two_fingers_swipe_distance(lv_event_t * e)`: Ottiene la distanza in pixel dal centro di partenza del gesto.

source: :cpp:expr:`lv_event_get_user_data(e)`: get the pointer passed as the last parameter of :cpp:func:`lv_obj_add_event_cb`.
it_it: :cpp:expr:`lv_event_get_user_data(e)`: ottiene il puntatore passato come ultimo parametro di :cpp:func:`lv_obj_add_event_cb`.

source: :cpp:expr:`lv_file_explorer_get_current_path(explorer)` (pointer to ``current_path`` ``char`` buffer)
it_it: :cpp:expr:`lv_file_explorer_get_current_path(explorer)` (puntatore al buffer ``current_path`` ``char``)

source: :cpp:expr:`lv_file_explorer_get_device_list(explorer)` (pointer to ``Device List`` :ref:`lv_list` Widget)
it_it: :cpp:expr:`lv_file_explorer_get_device_list(explorer)` (puntatore al Widget ``Device List`` :ref:`lv_list`)

source: :cpp:expr:`lv_file_explorer_get_file_table(explorer)` (pointer to ``File Table`` :ref:`lv_table` Widget)
it_it: :cpp:expr:`lv_file_explorer_get_file_table(explorer)` (puntatore al Widget ``File Table`` :ref:`lv_table`)

source: :cpp:expr:`lv_file_explorer_get_header(explorer)` (pointer to ``Header`` :ref:`base_widget` Widget)
it_it: :cpp:expr:`lv_file_explorer_get_header(explorer)` (puntatore al Widget ``Header`` :ref:`base_widget`)

source: :cpp:expr:`lv_file_explorer_get_path_label(explorer)` (pointer to ``Current Path Label`` :ref:`lv_label` Widget)
it_it: :cpp:expr:`lv_file_explorer_get_path_label(explorer)` (puntatore al Widget ``Current Path Label`` :ref:`lv_label`)

source: :cpp:expr:`lv_file_explorer_get_places_list(explorer)` (pointer to ``Places List`` :ref:`lv_list` Widget)
it_it: :cpp:expr:`lv_file_explorer_get_places_list(explorer)` (puntatore al Widget ``Places List`` :ref:`lv_list`)

source: :cpp:expr:`lv_file_explorer_get_quick_access_area(explorer)` (pointer to ``Quick-Access Panel`` :ref:`base_widget`)
it_it: :cpp:expr:`lv_file_explorer_get_quick_access_area(explorer)` (puntatore al ``Quick-Access Panel`` :ref:`base_widget`)

source: :cpp:expr:`lv_file_explorer_get_selected_file_name(explorer)` (pointer to NUL-terminated string containing file-path user selected; typically used inside an :cpp:enumerator:`LV_EVENT_CLICKED` event)
it_it: :cpp:expr:`lv_file_explorer_get_selected_file_name(explorer)` (puntatore a una stringa terminata da NULL contenente il path del file selezionato dall'utente; in genere utilizzato all'interno di un evento :cpp:enumerator:`LV_EVENT_CLICKED`)

source: :cpp:expr:`lv_file_explorer_get_sort(explorer)` returns the current sorting method.
it_it: :cpp:expr:`lv_file_explorer_get_sort(explorer)` restituisce il metodo di ordinamento corrente.

source: :cpp:expr:`lv_gif_set_src(widget, src)` works very similarly to :cpp:func:`lv_image_set_src`.
it_it: :cpp:expr:`lv_gif_set_src(widget, src)` funziona in modo molto simile a :cpp:func:`lv_image_set_src`.

source: :cpp:expr:`lv_grad_init_stops(grad_dsc, colors, opas, fracs, cnt)` initializes a gradient descriptor with stops containing the color, opacity and fraction of each stop.
it_it: :cpp:expr:`lv_grad_init_stops(grad_dsc, colors, opas, fracs, cnt)` inizializza un descrittore del gradiente con stop contenenti il colore, l'opacità e la frazione di ogni stop.

source: :cpp:expr:`lv_gridnav_remove(container)` Removes gridnav behavior from a Widget.
it_it: :cpp:expr:`lv_gridnav_remove(container)` Rimuove il comportamento di Gridnav da un Widget.

source: :cpp:expr:`lv_image_set_scale_x(img, factor)` and :cpp:expr:`lv_image_set_scale_y(img, factor)` can also be used to set the horizontal and vertical scaling independently.
it_it: :cpp:expr:`lv_image_set_scale_x(img, factor)` e :cpp:expr:`lv_image_set_scale_y(img, factor)` possono essere utilizzati anche per impostare il ridimensionamento orizzontale e verticale in modo indipendente.

source: :cpp:expr:`lv_indev_get_read_timer()` returns the read timer so that :ref:`timer`-related functions can be called on it to adjust its behavior.
it_it: :cpp:expr:`lv_indev_get_read_timer()` restituisce il timer di lettura in modo che le funzioni relative al :ref:`timer` possano essere chiamate su di esso per regolarne il comportamento.

source: :cpp:expr:`lv_indev_set_long_press_repeat_time(indev, ms)`: Interval between :cpp:enumerator:`LV_EVENT_LONG_PRESSED_REPEAT` events (in milliseconds)
it_it: :cpp:expr:`lv_indev_set_long_press_repeat_time(indev, ms)`: Intervallo tra gli eventi :cpp:enumerator:`LV_EVENT_LONG_PRESSED_REPEAT` (in millisecondi)

source: :cpp:expr:`lv_indev_set_long_press_time(indev, ms)`: Time required to send :cpp:enumerator:`LV_EVENT_LONG_PRESSED` (in milliseconds)
it_it: :cpp:expr:`lv_indev_set_long_press_time(indev, ms)`: Tempo richiesto per inviare :cpp:enumerator:`LV_EVENT_LONG_PRESSED` (in millisecondi)

source: :cpp:expr:`lv_indev_set_pinch_down_threshold(lv_indev_t * indev, float threshold)`: Set the pinch-down (zoom out) threshold in pixels.
it_it: :cpp:expr:`lv_indev_set_pinch_down_threshold(lv_indev_t * indev, float threshold)`: Imposta la soglia di pinch-down (zoom out) in pixel.

source: :cpp:expr:`lv_indev_set_pinch_up_threshold(lv_indev_t * indev, float threshold)`: Set the pinch-up (zoom in) threshold in pixels.
it_it: :cpp:expr:`lv_indev_set_pinch_up_threshold(lv_indev_t * indev, float threshold)`: Imposta la soglia di pinch-up (zoom in) in pixel.

source: :cpp:expr:`lv_indev_set_rotation_rad_threshold(lv_indev_t * indev, float threshold)`: Set the rotation angle threshold in radians.
it_it: :cpp:expr:`lv_indev_set_rotation_rad_threshold(lv_indev_t * indev, float threshold)`: Imposta la soglia dell'angolo di rotazione in radianti.

source: :cpp:expr:`lv_indev_set_scroll_limit(indev, pixels)`: Number of pixels to move before scrolling the widget
it_it: :cpp:expr:`lv_indev_set_scroll_limit(indev, pixels)`: Numero di pixel da spostare prima dello scrolling del widget

source: :cpp:expr:`lv_indev_set_scroll_throw(indev, percent)`: Scroll throw (momentum) slow-down in [%].
it_it: :cpp:expr:`lv_indev_set_scroll_throw(indev, percent)`: Rallentamento dello scrolling (inerzia) in [%].

source: :cpp:expr:`lv_label_get_text_selection_end(ta_label)` zero-based index of the character just after the selected text.
it_it: :cpp:expr:`lv_label_get_text_selection_end(ta_label)` indice a base zero del carattere subito dopo il testo selezionato.

source: :cpp:expr:`lv_label_get_text_selection_start(ta_label)` zero-based index of the first character of the selected text.
it_it: :cpp:expr:`lv_label_get_text_selection_start(ta_label)` indice a partire da zero del primo carattere del testo selezionato.

source: :cpp:expr:`lv_label_set_text(label, MY_USB_SYMBOL)` searches for this symbol in the font defined in the style's ``text.font`` property.
it_it: :cpp:expr:`lv_label_set_text(label, MY_USB_SYMBOL)` cerca questo simbolo nel font definito nella proprietà ``text.font`` dello stile.

source: :cpp:expr:`lv_label_set_text_selection_end(ta_label, index)` where ``index`` is the zero-based index of the character just after the selected text.
it_it: :cpp:expr:`lv_label_set_text_selection_end(ta_label, index)` dove ``index`` è l'indice a partire da zero del carattere subito dopo il testo selezionato.

source: :cpp:expr:`lv_label_set_text_selection_start(ta_label, index)` where ``index`` is the zero-based index of the first character of the selected text.
it_it: :cpp:expr:`lv_label_set_text_selection_start(ta_label, index)` dove ``index`` è l'indice a partire da zero del primo carattere del testo selezionato.

source: :cpp:expr:`lv_list_add_button(list, icon, text)` adds a full-width button with an icon (that can be an image or symbol) and text.
it_it: :cpp:expr:`lv_list_add_button(list, icon, text)` aggiunge un pulsante a larghezza intera con un'icona (che può essere un'immagine o un simbolo) e del testo.

source: :cpp:expr:`lv_list_add_text(list, text)` adds a text string.
it_it: :cpp:expr:`lv_list_add_text(list, text)` aggiunge una stringa di testo.

source: :cpp:expr:`lv_menu_back_button_is_root(menu, button)` to check if button is root back button.
it_it: :cpp:expr:`lv_menu_back_button_is_root(menu, button)` per verificare se il pulsante è il "root back button".

source: :cpp:expr:`lv_menu_cont_create(parent_page)` creates a new empty container.
it_it: :cpp:expr:`lv_menu_cont_create(parent_page)` crea un nuovo contenitore vuoto.

source: :cpp:expr:`lv_menu_create(parent)` creates a new empty Menu.
it_it: :cpp:expr:`lv_menu_create(parent)` crea un nuovo Menù vuoto.

source: :cpp:expr:`lv_menu_get_cur_main_page(menu)` returns a pointer to Menu Page that is currently displayed in the main container.
it_it: :cpp:expr:`lv_menu_get_cur_main_page(menu)` restituisce un puntatore alla Menu Page attualmente visualizzata nel contenitore principale.

source: :cpp:expr:`lv_menu_get_cur_sidebar_page(menu)` returns a pointer to Menu Page that is currently displayed in the sidebar container.
it_it: :cpp:expr:`lv_menu_get_cur_sidebar_page(menu)` restituisce un puntatore alla Menu Page attualmente visualizzata nel contenitore della barra laterale.

source: :cpp:expr:`lv_menu_page_create(menu, title)` creates a new empty Menu Page.
it_it: :cpp:expr:`lv_menu_page_create(menu, title)` crea una nuova Menu Page vuoto.

source: :cpp:expr:`lv_menu_section_create(parent_page)` creates a new empty section.
it_it: :cpp:expr:`lv_menu_section_create(parent_page)` crea una nuova sezione vuota.

source: :cpp:expr:`lv_menu_separator_create(parent_page)` creates a separator.
it_it: :cpp:expr:`lv_menu_separator_create(parent_page)` crea un separatore.

source: :cpp:expr:`lv_msgbox_close(msgbox)` closes (deletes) the message box.
it_it: :cpp:expr:`lv_msgbox_close(msgbox)` chiude (elimina) la finestra di messaggio.

source: :cpp:expr:`lv_msgbox_close_async(msgbox)` closes (deletes) the message box asynchronously.
it_it: :cpp:expr:`lv_msgbox_close_async(msgbox)` chiude (elimina) la finestra di messaggio in modo asincrono.

source: :cpp:expr:`lv_msgbox_create(parent)` creates a message box.
it_it: :cpp:expr:`lv_msgbox_create(parent)` crea una message box.

source: :cpp:expr:`lv_obj_add_subject_increment_event(obj, subject, trigger, step)` increments an integer subject's value by ``step``.
it_it: :cpp:expr:`lv_obj_add_subject_increment_event(obj, subject, trigger, step)` incrementa un valore di un Subject intero di ``step``.

source: :cpp:expr:`lv_obj_assign_id(class_p, widget)` will be called at the end of each Widget's creation, and
it_it: :cpp:expr:`lv_obj_assign_id(class_p, widget)` verrà chiamato al termine della creazione di ogni Widget e

source: :cpp:expr:`lv_obj_find_by_id(widget, id)` will perform a recursive walk through ``widget``\ 's children and return the first child encountered having the given ID.
it_it: :cpp:expr:`lv_obj_find_by_id(widget, id)` eseguirà un'esplorazione ricorsiva attraverso i figli di ``widget`` e restituirà il primo figlio incontrato con l'ID specificato.

source: :cpp:expr:`lv_obj_find_by_name(parent, "text")`: Find a Widget with a given name under a parent.
it_it: :cpp:expr:`lv_obj_find_by_name(parent, "text")`: Trova un Widget con un nome specificato sotto un elemento padre.
